In [1]:
import pandas as pd
import numpy as np

In [15]:
account = pd.read_csv('data/accountancy.csv')

In [16]:
account = account.drop(account.columns[0], axis=1)
account.head()

  Executor Type  Salary
0     Pupa    D      63
1     Pupa    A     158
2     Pupa    D     194
3     Pupa    E     109
4    Loopa    E     184

In [31]:
account.pivot_table(values='Salary',index='Type',columns='Executor', aggfunc=np.mean)

Executor       Loopa        Pupa
Type
A          58.000000  160.833333
B         145.166667   77.000000
C         154.333333   74.500000
D         137.714286  146.500000
E         164.000000  131.200000
F         238.000000  136.250000